In [1]:
import pandas as pd
import numpy as np

test_df = pd.read_csv('test.csv')
train_df = pd.read_csv('train.csv')
test_df.head()
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
test_age = test_df['Age'].mean()
train_age = train_df['Age'].mean()
print(f"test age mean: {test_age} vs train age mean: {train_age}")

test age mean: 30.272590361445783 vs train age mean: 29.69911764705882

In [7]:
test_df['Sex_code'] = test_df['Sex'].map({'male': 1, 'female': 2})
train_df['Sex_code'] = train_df['Sex'].map({'male': 1, 'female': 2})
testsex = test_df['Sex_code'].mean()
trainsex = train_df['Sex_code'].mean()
print(f"test sex mean: {testsex} vs train sex mean: {trainsex}")

test sex mean: 1.3636363636363635 vs train sex mean: 1.3524130190796857

In [ ]:
test_df['class_mean'] = test_df['Pclass'].mean()
train_df['class_mean'] = train_df['Pclass'].mean()
print(f"test class mean: {test_df['class_mean'].mean()} vs train class mean: {train_df['class_mean'].mean()}")

test class mean: 2.2655502392344498 vs train class mean: 2.308641975308642

: